In [54]:
import pandas as pd
import sqlalchemy as alch

from getpass import getpass

import cryptography
import sys
sys.path.append("../")

import src.support as sp

In [55]:
password = getpass("Contrase√±a de MySQL: ")

In [56]:
db_name = "videogames_industry"

conexion = f"mysql+pymysql://root:{password}@localhost/{db_name}"

In [57]:
engine = alch.create_engine(conexion)

#### All Games Unique to SQL

In [8]:
videogames_unique = pd.read_csv("../data/csv/all_games_unique.csv")
videogames_unique.drop(["Unnamed: 0"], axis=1, inplace=True)

In [41]:
videogames_unique.head(1)

     name  meta_score  user_review release_date
0  #DRIVE        69.0     6.990846   2021-02-16

In [42]:
# The use of "" in a text returns error when exporting to SQL.
videogames_unique.drop([4263], axis=0, inplace=True)

In [43]:
for index, row in videogames_unique.iterrows():
    videogame_id = engine.execute(f"""select videogame_id from videogames_unique WHERE videogame_id = "{row['name']}";""")

    if len(list(videogame_id)) > 0:
        print(f"sorry, id {row['name']} already exists")
    else:
        engine.execute(f"""
        INSERT INTO videogames_unique (videogame_id, meta_score, user_review, release_date) VALUES
        ("{row['name']}", "{row["meta_score"]}", "{row["user_review"]}", "{row["release_date"]}");""")

sorry, id 007: The World is not Enough already exists
sorry, id Bang! Gunship Elite already exists
sorry, id Bury me, my Love already exists
sorry, id Clustertruck already exists
sorry, id Deadcore already exists
sorry, id Doom already exists
sorry, id Doom 3 already exists
sorry, id Doom 3: Resurrection of Evil already exists
sorry, id Doom II already exists
sorry, id Enter the Gungeon already exists
sorry, id Everything already exists
sorry, id Flock! already exists
sorry, id Hatsune Miku: Project Diva f already exists
sorry, id Knights and Bikes already exists
sorry, id Lego Indiana Jones: The Original Adventures already exists
sorry, id Lego Star Wars already exists
sorry, id Lego Star Wars II: The Original Trilogy already exists
sorry, id Rallisport Challenge already exists
sorry, id Rush already exists
sorry, id Shiren the Wanderer: The Tower of Fortune and the Dice of Fate already exists
sorry, id Sinner: Sacrifice for Redemption already exists
sorry, id Spintires: Mudrunner already exists
sorry, id Tails of Iron already exists
sorry, id This is the Police already exists
sorry, id Torino 2006 - the Official Video Game of the XX Olympic Winter Games already exists
sorry, id Yaiba: Ninja Gaiden Z already exists
sorry, id moon already exists

#### Platforms to SQL

In [16]:
platforms = pd.read_csv("../data/csv/all_games.csv")
platforms.drop(["Unnamed: 0", "meta_score", "user_review", "summary"], axis=1, inplace=True)

In [17]:
platforms.head(2)

     name  platform release_date
0  #DRIVE    Switch   2021-02-16
1  #IDARB  Xbox One   2015-01-30

In [18]:
# Error on this row.
platforms.drop([6329], axis=0, inplace=True)

In [19]:
for index, row in platforms.iterrows():
        engine.execute(f"""
        INSERT INTO platforms (videogame_id, platform, release_date) VALUES
        ("{row['name']}","{row["platform"]}", "{row["release_date"]}");""")

#### Tourneys to SQL

In [11]:
df_tourneys = pd.read_csv("../data/tourneys/Tourneys.csv")
df_tourneys.drop(["Unnamed: 0"], axis=1,  inplace=True)
df_tourneys.head(1)

   posicion         juego    dinero  jugadores  torneos       fecha
0       1.0  StarCraft II  89399.27        105       53  2012-01-01

In [12]:
df_tourneys = df_tourneys[["juego","posicion","dinero","jugadores","torneos","fecha"]]
df_tourneys.head(1)

          juego  posicion    dinero  jugadores  torneos       fecha
0  StarCraft II       1.0  89399.27        105       53  2012-01-01

In [13]:
df_tourneys["fecha"] = pd.to_datetime(df_tourneys["fecha"])

In [14]:
# Error in this row.

df_tourneys.drop([4903], axis=0, inplace=True)

In [15]:
for index, row in df_tourneys.iterrows():
    
    engine.execute(f"""
        INSERT INTO torneos (videogame_id, posicion, dinero, jugadores, torneos, fecha) VALUES
        ("{row['juego']}","{row["posicion"]}", "{row["dinero"]}","{row["jugadores"]}", "{row["torneos"]}", "{row["fecha"]}");""")

#### Genres to SQL

In [58]:
df_genres = pd.read_csv("../data/generos/generos.csv")
df_genres.drop(["Unnamed: 0"], axis=1,  inplace=True)
df_genres.head()

         juego          Genre(s)
0  Injustice 2            Action
1  Injustice 2          Fighting
2  Injustice 2                2D
3   Saints Row  Action Adventure
4   Saints Row        Open-World

In [60]:
df_genres[df_genres["juego"] == "Fortnite"]

         juego      Genre(s)
1172  Fortnite        Action
1173  Fortnite       General
1174  Fortnite       Shooter
1175  Fortnite  Third-Person
1176  Fortnite      Tactical

In [61]:
for index, row in df_genres.iterrows():

    engine.execute(f"""
        INSERT INTO genres (videogame_id, genre) VALUES
        ("{row['juego']}","{row["Genre(s)"]}");""")

#### General Info to SQL

In [23]:
df_info = pd.read_csv("../data/generos/info_general.csv")
df_info.drop(["Unnamed: 0"], axis=1,  inplace=True)
df_info.head()

,juego,Developer,# of players,Rating
0,Injustice 2,QLOC,Online Multiplayer,T
1,Saints Row,Volition Inc.,NaN,M
2,Shenmue III,Ys Net,No Online Multiplayer,T
3,Assassin's Creed Valhalla,Ubisoft Montreal,No Online Multiplayer,M
4,Planet Coaster,Frontier Developments,No Online Multiplayer,E

In [24]:
for index, row in df_info.iterrows():

    engine.execute(f"""
        INSERT INTO info_general (videogame_id, developer, jugadores, rating) VALUES
        ("{row['juego']}","{row["Developer"]}","{row["# of players"]}","{row["Rating"]}");""")

#### Twitch to SQL

In [26]:
df_twitch = pd.read_csv("../data/twitch/twitch.csv")
df_twitch.drop(["Unnamed: 0"], axis=1,  inplace=True)
df_twitch.head(1)

,game,watch_time_(hours),stream_time_(hours),peak_viewers,peak_channels,streamers,average_viewers,average_channels,average_viewer_ratio,fecha
0,League of Legends,88389049.0,1217250.0,553165,2945,113251,122933,1692,72.61,2016-04-01

In [27]:
for index, row in df_twitch.iterrows():

    engine.execute(f"""
        INSERT INTO twitch (videogame_id, watch_time_hours, stream_time_hours, peak_viewers, peak_channels, streamers, average_viewers, average_channels, average_viewer_ratio, fecha) VALUES
        ("{row['game']}","{row["watch_time_(hours)"]}","{row["stream_time_(hours)"]}","{row["peak_viewers"]}","{row["peak_channels"]}","{row["streamers"]}","{row["average_viewers"]}","{row["average_channels"]}","{row["average_viewer_ratio"]}","{row["fecha"]}");""")

#### Youtube to SQL

In [39]:
def youtube_tosql(game):
    df_youtube = pd.read_csv(f"../data/youtube/api/{game}.csv")
    df_youtube.drop(["Unnamed: 0"], axis=1,  inplace=True)

    for index, row in df_youtube.iterrows():
        try:
            engine.execute(f"""
            INSERT INTO youtube (fecha, duration, viewcount, likecount, commentcount, videogame_id) VALUES
            ("{row['publishedat']}","{row['duration']}","{row['viewcount']}","{row['likecount']}","{row['commentcount']}","{row['juego']}");""")
        except ValueError:
            print("este titulo no es valido en SQL")

In [46]:
youtube_tosql("callofduty")